OpenFOAM/freeSurfaceFlows/freeSurfaceFlows-0Fv2012/cases/RayleighTaylor-v2012/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( -0.5 -0.015625 -2.0)
    (  0.5 -0.015625 -2.0)
    (  0.5  0.015625 -2.0)
    ( -0.5  0.015625 -2.0)
    ( -0.5 -0.015625  2.0)
    (  0.5 -0.015625  2.0)
    (  0.5  0.015625  2.0)
    ( -0.5  0.015625  2.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (128 1 512) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    symmetric
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (0 3 7 4)
            (1 2 6 5)
	    (4 5 6 7)
	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
